'''
Задача №2

Дано розклад прибуття і відправлення поїздів.
Визначити мінімальну кількість платформ, необхідних для забезпечення того,
щоб жоден поїзд не чекав іншого.

Виконала студентка 31І групи Гриб Наталія
'''

def min_platforms(arrival, departure):
    n = len(arrival)
    # Сортуємо часи прибуття та відправлення
    arrival.sort()
    departure.sort()
    
    # Початкова кількість платформ та максимальна кількість платформ, що потрібна
    platforms = 1
    result = 1
    i = 1
    j = 0
    
    # Проходимо по всіх часах прибуття та відправлення
    while i < n and j < n:
        # Якщо поїзд прибуває раніше, ніж попередній відправляється,
        # це означає, що потрібна нова платформа
        if arrival[i] <= departure[j]:
            platforms += 1
            i += 1
        # Якщо поїзд відправляється раніше, ніж інший прибуває,
        # це означає, що одна платформа звільняється
        elif arrival[i] > departure[j]:
            platforms -= 1
            j += 1
        
        # Оновлюємо максимальну кількість платформ, необхідних
        result = max(result, platforms)
    
    return result

# Приклад використання:
arrival = [13, 14, 16, 17, 19]
departure = [15, 17, 18, 19, 21]
print("Мінімальна кількість платформ:", min_platforms(arrival, departure))
